Repository: lyh543/ham-gallery
Catalog: FluentGallery/Strings/*/Resources.resw
Source language: en_us
Languages: zh_cn

# NavItem_Albums.Content
source: Albums
zh_cn: 相册

# NavItem_AllPhotos.Content
source: All Photos
zh_cn: 所有照片

# NavItem_Settings.Content
source: Settings
zh_cn: 设置

# MainWindow_AlbumsNavItem.Content
source: Albums
zh_cn: 相册

# MainWindow_AllPhotosNavItem.Content
source: All Photos
zh_cn: 所有照片

# MainWindow_SearchNavItem.Content
source: Search
zh_cn: 搜索

# MainWindow_SettingsNavItem.Content
source: Settings
zh_cn: 设置

# MainWindow_DevWarnMuteButton.Content
source: Don't show again this session
zh_cn: 本次启动不再提示

# AlbumList_Title
source: Albums
zh_cn: 相册

# AlbumList_CreateButton_Text
source: New Album
zh_cn: 新建相册

# AlbumList_DeleteDialog_Title
source: Delete Album
zh_cn: 删除相册

# AlbumList_DeleteDialog_Content
source: Are you sure you want to delete this album? The photos inside will not be deleted.
zh_cn: 确定要删除这个相册吗？相册内的照片不会被删除。

# AlbumCard_PhotoCountSuffix.Text
source: photos
zh_cn: 张

# AlbumList_CreateAlbumButton.Label
source: New Album
zh_cn: 新建相册

# AlbumList_SortButton.Label
source: Sort
zh_cn: 排序

# AlbumList_SortByName.Text
source: Name
zh_cn: 名称

# AlbumList_SortByCreated.Text
source: Created Date
zh_cn: 创建时间

# AlbumList_SortByModified.Text
source: Modified Date
zh_cn: 修改时间

# AlbumList_SortByTakenAt.Text
source: Taken Date
zh_cn: 拍摄时间

# AlbumList_SortByPhotoCount.Text
source: Photo Count
zh_cn: 照片数量

# AlbumList_SortDescToggle.Text
source: Ascending
zh_cn: 升序

# AlbumList_ZoomInButton.Label
source: Zoom In
zh_cn: 放大

# AlbumList_ZoomOutButton.Label
source: Zoom Out
zh_cn: 缩小

# AlbumList_EmptyTitle.Text
source: No albums yet
zh_cn: 还没有相册

# AlbumList_EmptySubtitle.Text
source: Click "New Album" to create your first album
zh_cn: 点击「添加文件夹」添加第一个文件夹

# PhotoList_AddPhotos_Text
source: Add Photos
zh_cn: 添加照片

# PhotoList_Delete_Text
source: Delete
zh_cn: 删除

# PhotoList_MoveToAlbum_Text
source: Move to Album
zh_cn: 移动到相册

# AllPhotos_MultiSelectToggle.Label
source: Multi-Select
zh_cn: 多选

# AllPhotos_DeleteButton.Label
source: Delete
zh_cn: 删除

# AllPhotos_MoveToAlbumButton.Label
source: Move to Album
zh_cn: 移到相册

# AllPhotos_SortButton.Label
source: Sort
zh_cn: 排序

# AllPhotos_SortByName.Text
source: File Name
zh_cn: 文件名

# AllPhotos_SortBySize.Text
source: File Size
zh_cn: 文件大小

# AllPhotos_SortByCreated.Text
source: Created Date
zh_cn: 创建时间

# AllPhotos_SortByModified.Text
source: Modified Date
zh_cn: 修改时间

# AllPhotos_SortByTakenAt.Text
source: Taken Date
zh_cn: 拍摄时间

# AllPhotos_SortDescToggle.Text
source: Ascending
zh_cn: 升序

# AllPhotos_ZoomInButton.Label
source: Zoom In
zh_cn: 放大

# AllPhotos_ZoomOutButton.Label
source: Zoom Out
zh_cn: 缩小

# AllPhotos_SearchToggle.Label
source: Search
zh_cn: 搜索

# AllPhotos_KeywordLabel.Text
source: File Name
zh_cn: 文件名

# AllPhotos_KeywordBox.PlaceholderText
source: Enter file name keywords...
zh_cn: 输入文件名关键词...

# AllPhotos_DateFromLabel.Text
source: Start Date
zh_cn: 起始日期

# AllPhotos_DateToLabel.Text
source: End Date
zh_cn: 截止日期

# AllPhotos_SearchButton.Content
source: Search
zh_cn: 搜索

# AllPhotos_ClearButton.Content
source: Clear
zh_cn: 清除

# AllPhotos_EmptyTitle.Text
source: No photos
zh_cn: 没有照片

# AllPhotos_EmptySubtitle.Text
source: No matching photos were found
zh_cn: 当前没有找到匹配的照片

# PhotoList_AddPhotosButton.Label
source: Add Photos
zh_cn: 添加照片

# PhotoList_DeleteButton.Label
source: Delete
zh_cn: 删除

# PhotoList_MoveToAlbumButton.Label
source: Move to Album
zh_cn: 移到相册

# PhotoList_RenameAlbumButton.Label
source: Rename
zh_cn: 重命名

# PhotoList_SortButton.Label
source: Sort
zh_cn: 排序

# PhotoList_SortByName.Text
source: File Name
zh_cn: 文件名

# PhotoList_SortBySize.Text
source: File Size
zh_cn: 文件大小

# PhotoList_SortByCreated.Text
source: Created Date
zh_cn: 创建时间

# PhotoList_SortByModified.Text
source: Modified Date
zh_cn: 修改时间

# PhotoList_SortByTakenAt.Text
source: Taken Date
zh_cn: 拍摄时间

# PhotoList_SortDescToggle.Text
source: Ascending
zh_cn: 升序

# PhotoList_MultiSelectToggle.Label
source: Multi-Select
zh_cn: 多选

# PhotoList_ZoomInButton.Label
source: Zoom In
zh_cn: 放大

# PhotoList_ZoomOutButton.Label
source: Zoom Out
zh_cn: 缩小

# PhotoList_SearchButton.Label
source: Search
zh_cn: 搜索

# PhotoList_EmptyTitle.Text
source: No photos in this album yet
zh_cn: 相册中还没有照片

# PhotoList_EmptySubtitle.Text
source: Click "Add Photos" to add photos to this album
zh_cn: 点击「添加照片」将照片加入此相册

# PhotoDetail_FileNotFound
source: File has been moved or deleted.
zh_cn: 文件已移动或删除。

# PhotoDetail_HeicNotSupported
source: HEIC/HEIF format requires HEVC Video Extensions. Tap to install from Microsoft Store.
zh_cn: HEIC/HEIF 格式需要安装「HEVC 视频扩展」。点击前往 Microsoft Store 安装。

# PhotoDetail_ToastUndoText.Text
source: Undo
zh_cn: 撤销

# PhotoDetail_InfoTitle.Text
source: Photo Information
zh_cn: 照片信息

# PhotoDetail_FileNameLabel.Text
source: File Name
zh_cn: 文件名

# PhotoDetail_PathLabel.Text
source: Path
zh_cn: 路径

# PhotoDetail_FileSizeLabel.Text
source: File Size
zh_cn: 文件大小

# PhotoDetail_ResolutionLabel.Text
source: Resolution
zh_cn: 分辨率

# PhotoDetail_CreatedAtLabel.Text
source: Created Date
zh_cn: 创建时间

# PhotoDetail_ModifiedAtLabel.Text
source: Modified Date
zh_cn: 修改时间

# PhotoDetail_TakenAtLabel.Text
source: Taken Date
zh_cn: 拍摄时间

# PhotoDetail_CameraLabel.Text
source: Camera
zh_cn: 相机

# PhotoDetail_LensLabel.Text
source: Lens
zh_cn: 镜头

# PhotoDetail_ApertureLabel.Text
source: Aperture
zh_cn: 光圈

# PhotoDetail_ShutterLabel.Text
source: Shutter Speed
zh_cn: 快门速度

# PhotoDetail_FocalLengthLabel.Text
source: Focal Length
zh_cn: 焦距

# PhotoDetail_ColorSpaceLabel.Text
source: Color Space
zh_cn: 颜色空间

# PhotoDetail_BitDepthLabel.Text
source: Bit Depth
zh_cn: 位深

# PhotoDetail_OrientationLabel.Text
source: Orientation
zh_cn: 方向

# PhotoDetail_GpsLabel.Text
source: GPS Coordinates
zh_cn: GPS 坐标

# PhotoDetail_GifDurationFramesLabel.Text
source: Duration / Frames
zh_cn: 时长 / 帧数

# PhotoDetail_GifFrameRateLabel.Text
source: Frame Rate
zh_cn: 帧率

# AllPhotos_Title
source: All Photos
zh_cn: 所有照片

# AllPhotos_SearchPlaceholder
source: Search by file name…
zh_cn: 按文件名搜索…

# Search_KeywordLabel.Text
source: File Name
zh_cn: 文件名

# Search_KeywordBox.PlaceholderText
source: Enter file name keywords (fuzzy match supported)
zh_cn: 输入文件名关键词（支持模糊匹配）

# Search_DateFieldLabel.Text
source: Date Field
zh_cn: 时间字段

# Search_DateFieldTakenAt.Content
source: Taken Date
zh_cn: 拍摄时间

# Search_DateFieldModifiedAt.Content
source: Modified Date
zh_cn: 修改时间

# Search_DateFieldCreatedAt.Content
source: Created Date
zh_cn: 创建时间

# Search_DateFromLabel.Text
source: From
zh_cn: 从

# Search_DateFromPicker.PlaceholderText
source: Start Date
zh_cn: 开始日期

# Search_DateToLabel.Text
source: To
zh_cn: 至

# Search_DateToPicker.PlaceholderText
source: End Date
zh_cn: 结束日期

# Search_ClearDatesButton.Content
source: Clear Dates
zh_cn: 清除日期

# Search_SearchButton.Content
source: Search
zh_cn: 搜索

# Search_EmptyTitle.Text
source: No matching photos found
zh_cn: 没有找到匹配的照片

# Search_EmptySubtitle.Text
source: Try changing the keywords or adjusting the date range
zh_cn: 请尝试修改关键词或调整时间范围

# Search_PromptText.Text
source: Enter keywords or select a date range, then click "Search"
zh_cn: 输入关键词或选择时间范围，然后点击「搜索」

# Settings_Title
source: Settings
zh_cn: 设置

# Settings_ScanDirectories_Header
source: Scan Directories
zh_cn: 扫描目录

# Settings_Appearance_Header
source: Appearance
zh_cn: 外观

# Settings_Behavior_Header
source: Behavior
zh_cn: 行为

# Settings_CacheData_Header
source: Cache & Data
zh_cn: 缓存与数据

# Settings_About_Header
source: About
zh_cn: 关于

# Common_OK
source: OK
zh_cn: 确定

# Common_Cancel
source: Cancel
zh_cn: 取消

# Common_Delete
source: Delete
zh_cn: 删除

# Common_Rename
source: Rename
zh_cn: 重命名

# Common_Scanning
source: Scanning…
zh_cn: 正在扫描…

# IndexPrompt_TitleTextBlock.Text
source: Index this new folder?
zh_cn: 索引新文件夹？

# IndexPrompt_CancelButton.Content
source: Not Now
zh_cn: 暂不加入

# IndexPrompt_ConfirmButton.Content
source: Add and Index
zh_cn: 加入并索引

# MainWindow_Context_Unpin
source: Unpin
zh_cn: 取消固定

# AlbumList_CreateAlbum_Placeholder
source: Album name
zh_cn: 相册名称

# AlbumList_CreateAlbum_Title
source: New Album
zh_cn: 新建相册

# AlbumList_CreateAlbum_Confirm
source: Create
zh_cn: 创建

# AlbumList_Context_Rename
source: Rename
zh_cn: 重命名

# AlbumList_Context_Unpin
source: Unpin
zh_cn: 取消固定

# AlbumList_Context_Pin
source: Pin to Navigation
zh_cn: 固定到导航栏

# AlbumList_Context_Delete
source: Delete
zh_cn: 删除

# AlbumList_DeleteConfirm_Title
source: Delete Album
zh_cn: 删除相册

# AlbumList_DeleteConfirm_Content
source: Are you sure you want to delete this album? The photos inside will not be deleted.
zh_cn: 确定要删除这个相册吗？相册内的照片不会被删除。

# AlbumList_DeleteConfirm_Confirm
source: Delete
zh_cn: 移到回收站

# AllPhotos_DeleteConfirm_Title
source: Delete Photos
zh_cn: 删除照片

# AllPhotos_DeleteConfirm_Content
source: Move {0} selected photos to Recycle Bin?
zh_cn: 确定要将选中的 {0} 张照片移入回收站吗？

# AllPhotos_DeleteConfirm_Confirm
source: Move to Recycle Bin
zh_cn: 移入回收站

# AllPhotos_MoveToAlbum_Empty
source: No albums
zh_cn: 没有相册

# PhotoList_DeleteConfirm_Title
source: Delete Photos
zh_cn: 删除照片

# PhotoList_DeleteConfirm_Content
source: Move {0} selected photos to Recycle Bin?
zh_cn: 确定要将选中的 {0} 张照片移入回收站吗？

# PhotoList_DeleteConfirm_Confirm
source: Move to Recycle Bin
zh_cn: 移入回收站

# PhotoList_MoveToAlbum_Empty
source: No other albums
zh_cn: 没有其他相册

# Search_ScopeHint
source: Search scope: album "{0}"
zh_cn: 搜索范围：相册「{0}」

# Search_ResultCount_AlbumScope
source: album "{0}"
zh_cn: 「{0}」相册中

# Search_ResultCount_AllScope
source: all photos
zh_cn: 全库

# Search_ResultCount_Text
source: Found {1} photos in {0}
zh_cn: 在{0}找到 {1} 张照片

# Search_Header_Album
source: Search · {0}
zh_cn: 搜索 · {0}

# Search_Header_Default
source: Search
zh_cn: 搜索

# Settings_ClearThumb_Title
source: Clear Thumbnail Cache
zh_cn: 清除缩略图缓存

# Settings_ClearThumb_Content
source: This will delete all cached thumbnail files. They will be regenerated when viewed next time and may take a while. Continue?
zh_cn: 这将删除所有缓存的缩略图文件。下次查看照片时将重新生成，可能需要一些时间。 确定要继续吗？

# Settings_ClearThumb_Confirm
source: Clear
zh_cn: 清除

# Settings_ClearDb_Title
source: Clear Database Cache
zh_cn: 清除数据库缓存

# Settings_ClearDb_Content
source: This clears all photo/thumbnail database records while keeping album structure and settings. Photos will reappear after re-scan. Continue?
zh_cn: 这将清空所有照片和缩略图的数据库记录，相册结构和设置将保留。 再次扫描目录后照片将重新出现。确定要继续吗？

# Settings_ClearDb_Confirm
source: Clear
zh_cn: 清除

# Settings_ClearAll_Title
source: Clear All Data
zh_cn: 清除全部数据

# Settings_ClearAll_Content
source: This will delete all photo records, albums, thumbnail files, and app settings, restoring factory defaults. This action cannot be undone. Continue?
zh_cn: 这将删除所有照片记录、相册、缩略图文件和应用设置，应用将恢复出厂状态。 此操作不可撤销，确定要继续吗？

# Settings_ClearAll_Confirm
source: Clear All Data
zh_cn: 清除全部数据

# Settings_DoneSub_AllExist
source: All photos already have thumbnails
zh_cn: 所有照片均已有缩略图，无需生成

# Settings_DoneSub_Generated
source: Generated {0} thumbnails in total
zh_cn: 共生成了 {0} 张缩略图

# PhotoDetail_Delete_DontAsk
source: Don't ask again
zh_cn: 下次不再提示

# PhotoDetail_Delete_ConfirmText
source: Move "{0}" to Recycle Bin?
zh_cn: 将「{0}」移入回收站？

# PhotoDetail_Delete_DialogTitle
source: Delete Photo
zh_cn: 删除照片

# PhotoDetail_Delete_DialogConfirm
source: Delete
zh_cn: 删除

# PhotoDetail_Toast_DisableConfirm
source: Delete confirmation disabled. You can re-enable it in Settings.
zh_cn: 已关闭删除确认弹窗，可在设置中重新开启

# PhotoDetail_Toast_DeleteFailed
source: Delete failed. Please check file permissions.
zh_cn: 删除失败，请检查文件权限

# PhotoDetail_Toast_Deleted
source: Photo "{0}" deleted
zh_cn: 照片「{0}」已删除

# PhotoDetail_Toast_UndoFailed
source: Restore failed. File may have been moved or deleted.
zh_cn: 恢复失败，文件可能已被移动或删除

# PhotoDetail_Toast_Restored
source: Photo "{0}" restored
zh_cn: 照片「{0}」已恢复

# PhotoDetail_IndexPrompt_Title
source: Add to albums
zh_cn: 加入相册

# PhotoDetail_IndexPrompt_Message
source: The current photo directory is not in scan scope yet. Add this directory and build index in background? Filmstrip will be enabled automatically after indexing completes.
zh_cn: 当前图片所在目录尚未加入扫描范围。是否将该目录加入相册并在后台建立索引？建立完成后将自动启用胶片栏。

# PhotoDetail_IndexPrompt_Confirm
source: Add and Index
zh_cn: 加入并索引

# PhotoDetail_IndexPrompt_Cancel
source: Not Now
zh_cn: 暂不加入

# PhotoDetail_Toast_Indexing
source: Directory added to scan scope. Building index…
zh_cn: 已加入扫描范围，正在建立索引…

# PhotoDetail_Toast_IndexDone
source: Index complete. Filmstrip is now available.
zh_cn: 索引完成，胶片栏已可用

# PhotoDetail_Toast_FirstPhoto
source: Already at the first photo
zh_cn: 已经是第一张照片了

# PhotoDetail_Toast_LastPhoto
source: Already at the last photo
zh_cn: 已经是最后一张照片了

# Settings_ThumbnailCacheSize_Computing
source: Calculating…
zh_cn: 计算中…

# Settings_ThumbnailCacheSize_Unknown
source: Unknown
zh_cn: 未知

# Settings_ThumbnailExpanderDescription
source: {0} thumbnails, size {1}
zh_cn: 共 {0} 张缩略图，大小 {1}

# Settings_ThumbProgress_Generated
source: Generated {0} / {1}
zh_cn: 已生成 {0} / {1} 张

# Settings_ThumbProgress_Querying
source: Querying…
zh_cn: 正在查询…

# Settings_ThumbStats
source: Speed: {0:F1}/s {1}
zh_cn: 速度：{0:F1} 张/秒 {1}

# Settings_Status_LanguageRestart
source: Language will take effect on next app launch
zh_cn: 语言将在下次启动应用时生效

# Settings_Status_FileAssocRegistered
source: File associations registered
zh_cn: 文件关联已注册

# Settings_Status_FileAssocUnregistered
source: File associations unregistered
zh_cn: 文件关联已取消注册

# Settings_Status_FileAssocFailed
source: Failed to update file associations: {0}
zh_cn: 注册文件关联失败：{0}

# Settings_Status_ThumbCacheCleared
source: Thumbnail cache cleared
zh_cn: 缩略图缓存已清除

# Settings_Status_ClearFailed
source: Clear failed: {0}
zh_cn: 清除失败：{0}

# Settings_Status_DbCacheCleared
source: Database cache cleared. Re-scanning…
zh_cn: 数据库缓存已清除，正在重新扫描…

# Settings_Status_AllDataCleared
source: All data cleared. App restored to factory state.
zh_cn: 所有数据已清除，应用已恢复出厂状态

# Settings_Status_OpenThumbFolder_Failed
source: Unable to open thumbnail folder: {0}
zh_cn: 无法打开缩略图目录：{0}

# Settings_Status_OpenLogsFolder_Failed
source: Unable to open logs folder: {0}
zh_cn: 无法打开日志目录：{0}

# Settings_Status_GenerateThumbFailed
source: Generate thumbnails failed: {0}
zh_cn: 生成缩略图失败：{0}

# Settings_Status_RestartFailed
source: Unable to restart app: {0}
zh_cn: 无法重启应用：{0}

# Settings_FormatEta_Sec
source: ETA {0} s
zh_cn: 预计剩余 {0} 秒

# Settings_FormatEta_Min
source: ETA {0} m {1} s
zh_cn: 预计剩余 {0} 分 {1} 秒

# Settings_FormatEta_Hour
source: ETA {0} h {1} m
zh_cn: 预计剩余 {0} 小时 {1} 分

# SettingsPage_ScanSectionTitle.Text
source: Scan Directories
zh_cn: 扫描目录

# SettingsPage_ScanExpander.Header
source: Scan Directories
zh_cn: 扫描目录

# SettingsPage_ScanExpander.Description
source: Photos from these directories will be scanned after app startup
zh_cn: 应用启动后将扫描这些目录中的照片

# SettingsPage_AddScanDirButton.Content
source: + Add Directory
zh_cn: ＋ 添加目录

# SettingsPage_RemoveScanDirButton.ToolTipService.ToolTip
source: Remove this directory
zh_cn: 删除此目录

# SettingsPage_ExcludeExpander.Header
source: Excluded Directories
zh_cn: 排除目录

# SettingsPage_ExcludeExpander.Description
source: Skip these directories during scan (absolute paths supported)
zh_cn: 扫描时跳过这些目录（支持绝对路径）

# SettingsPage_AddExcludeDirButton.Content
source: + Add Excluded Directory
zh_cn: ＋ 添加排除目录

# SettingsPage_RemoveExcludeDirButton.ToolTipService.ToolTip
source: Remove this directory
zh_cn: 删除此目录

# SettingsPage_AppearanceSectionTitle.Text
source: Appearance
zh_cn: 外观

# SettingsPage_LanguageCard.Header
source: Language
zh_cn: 语言

# SettingsPage_LanguageCard.Description
source: App restart required after language change
zh_cn: 切换语言后需要重新启动应用

# SettingsPage_Language_System.Content
source: Follow system
zh_cn: 跟随系统

# SettingsPage_Language_ZhHans.Content
source: Chinese (Simplified)
zh_cn: 中文（简体）

# SettingsPage_Language_JaJp.Content
source: Japanese
zh_cn: 日语

# SettingsPage_Language_KoKr.Content
source: Korean
zh_cn: 韩语

# SettingsPage_Language_DeDe.Content
source: German
zh_cn: 德语

# SettingsPage_Language_FrFr.Content
source: French
zh_cn: 法语

# SettingsPage_Language_EsEs.Content
source: Spanish
zh_cn: 西班牙语

# SettingsPage_ThemeCard.Header
source: App Theme
zh_cn: 应用主题

# SettingsPage_ThemeCard.Description
source: Takes effect immediately, no restart needed
zh_cn: 立即生效，无需重启

# SettingsPage_Theme_System.Content
source: Follow system
zh_cn: 跟随系统

# SettingsPage_Theme_Light.Content
source: Light
zh_cn: 浅色

# SettingsPage_Theme_Dark.Content
source: Dark
zh_cn: 深色

# SettingsPage_AcrylicCard.Header
source: Acrylic Material
zh_cn: 亚克力材料

# SettingsPage_AcrylicCard.Description
source: Use Acrylic instead of Mica, effective immediately
zh_cn: 使用亚克力效果替代 Mica，立即生效

# SettingsPage_BehaviorSectionTitle.Text
source: Behavior
zh_cn: 行为

# SettingsPage_ConfirmDeleteCard.Header
source: Confirm Before Delete
zh_cn: 删除前确认

# SettingsPage_ConfirmDeleteCard.Description
source: Show confirmation dialog before moving photos to Recycle Bin
zh_cn: 将照片移入回收站前弹出确认对话框

# SettingsPage_FileAssocCard.Header
source: Register File Associations
zh_cn: 添加文件关联

# SettingsPage_FileAssocCard.Description
source: Register JPG, PNG, HEIC and other image formats for current user without admin rights, while preserving Explorer thumbnails when possible
zh_cn: 为 JPG、PNG、HEIC 等图片格式注册文件关联（仅对当前用户生效，无需管理员权限，并尽量保留资源管理器缩略图）

# SettingsPage_CacheSectionTitle.Text
source: Cache & Data
zh_cn: 缓存与数据

# SettingsPage_ThumbnailExpander.Header
source: Thumbnails
zh_cn: 缩略图

# SettingsPage_OpenThumbFolderCard.Header
source: Open Thumbnail Folder
zh_cn: 打开缩略图目录

# SettingsPage_OpenFolderButton.Content
source: Open Folder
zh_cn: 打开目录

# SettingsPage_RegenerateThumbCard.Header
source: Regenerate Thumbnails
zh_cn: 重新生成缩略图

# SettingsPage_RegenerateThumbCard.Description
source: Generate thumbnails for all photos missing them
zh_cn: 为所有缺失缩略图的照片生成缩略图

# SettingsPage_GenerateNowButton.Content
source: Generate Now
zh_cn: 立即生成

# SettingsPage_ClearThumbCard.Header
source: Clear Thumbnail Cache
zh_cn: 清除缩略图缓存

# SettingsPage_ClearThumbCard.Description
source: Thumbnails will be regenerated next time photos are viewed
zh_cn: 下次查看照片时将重新生成

# SettingsPage_ClearThumbButton.Content
source: Clear Cache
zh_cn: 清除缓存

# SettingsPage_CancelThumbBuildButton.Content
source: Cancel
zh_cn: 取消

# SettingsPage_ThumbDoneTitle.Text
source: All Done!
zh_cn: 全部完成！

# SettingsPage_ClearDbCard.Header
source: Clear Database Index
zh_cn: 清除数据库索引

# SettingsPage_ClearDbCard.Description
source: Clear photo index and thumbnail records, keep photo files and settings
zh_cn: 清空照片索引和缩略图记录，照片文件和设置将保留

# SettingsPage_ClearDbButton.Content
source: Clear Index
zh_cn: 清除索引

# SettingsPage_LogsCard.Header
source: App Logs
zh_cn: 应用日志

# SettingsPage_LogsCard.Description
source: Open logs folder in File Explorer (one file per day, keep last 7 days)
zh_cn: 在文件管理器中打开日志目录（每天一个文件，保留最近 7 天）

# SettingsPage_OpenLogsButton.Content
source: Open Logs Folder
zh_cn: 打开日志目录

# SettingsPage_ClearAllCard.Header
source: Clear All Data
zh_cn: 清除全部数据

# SettingsPage_ClearAllCard.Description
source: Delete all app data (photo index, thumbnails, settings) and restore factory state while keeping photo files safe
zh_cn: 删除所有应用数据（照片索引、缩略图、设置），恢复出厂状态，照片文件将安全保留

# SettingsPage_ClearAllButton.Content
source: Clear All Data
zh_cn: 清除全部数据

# SettingsPage_PerfSectionTitle.Text
source: Performance
zh_cn: 性能

# SettingsPage_PreloadExpander.Header
source: Preload Count
zh_cn: 预加载张数

# SettingsPage_PreloadExpander.Description
source: Higher preload improves browsing smoothness but uses more memory
zh_cn: 预加载更多张数，快速翻看时更流畅，但会占用更多内存

# SettingsPage_PreloadBackCard.Header
source: Backward Preload Count
zh_cn: 向前预加载张数

# SettingsPage_PreloadBackCard.Description
source: Extra photos to preload behind current
zh_cn: 额外预加载前方图片

# SettingsPage_PreloadForwardCard.Header
source: Forward Preload Count
zh_cn: 向后预加载张数

# SettingsPage_PreloadForwardCard.Description
source: Extra photos to preload ahead of current
zh_cn: 额外预加载后方图片

# SettingsPage_ThumbSizeCard.Header
source: Thumbnail Size
zh_cn: 缩略图尺寸

# SettingsPage_ThumbSizeCard.Description
source: Larger size gives clearer thumbnails, but uses more storage and generates slower
zh_cn: 尺寸越大，缩略图越清晰，但会占用更多存储空间，生成速度也更慢

# SettingsPage_ThumbSizeHint.Title
source: Thumbnail Size Changed
zh_cn: 缩略图尺寸已更改

# SettingsPage_ThumbSizeHint.Message
source: Existing thumbnails remain at old size. Clear cache to regenerate at new size.
zh_cn: 历史缩略图将继续以旧尺寸展示，清理缓存后才会按新尺寸重新生成

# SettingsPage_ThumbSizeHintAction.Content
source: Clear Now
zh_cn: 立即清理

# SettingsPage_RestartNowAction.Content
source: Restart Now
zh_cn: 立即重启

# SettingsPage_DebugSectionTitle.Text
source: Debug
zh_cn: 调试

# SettingsPage_ForceGcCard.Header
source: Force GC
zh_cn: 强制 GC

# SettingsPage_ForceGcCard.Description
source: Release unmanaged memory (WIC decode surfaces, COM objects). Use when memory is not reclaimed promptly after page switches.
zh_cn: 释放非托管内存（WIC 解码面、COM 对象）。切换页面后内存未及时回收时使用。

# SettingsPage_ForceGcButton.Content
source: Collect Now
zh_cn: 立即回收

# SettingsPage_ShowCardSizeToastCard.Header
source: Show Size While Zooming
zh_cn: 相册缩放时显示尺寸

# SettingsPage_ShowPreloadStatusCard.Header
source: Show Preload Status
zh_cn: 显示预加载状态

# SettingsPage_ShowPreloadStatusCard.Description
source: Show preload progress badges at top-right of filmstrip thumbnails in photo detail
zh_cn: 在照片详情页胶片栏缩略图右上角显示预加载进度角标

# SettingsPage_DebugKeepChromeCard.Header
source: Keep Photo Detail Chrome Visible
zh_cn: 图片详情页工具栏常亮

# SettingsPage_DebugKeepChromeCard.Description
source: Debug option. Keep top/bottom toolbars and zoom slider always visible on photo detail page, disabling hover-triggered auto hide.
zh_cn: 调试选项。开启后，图片详情页顶部工具栏、底部工具栏和缩放条会始终显示，不再响应鼠标移入/移出触发的自动隐藏逻辑。

# SettingsPage_AboutSectionTitle.Text
source: About
zh_cn: 关于

# SettingsPage_AppInfoCard.Header
source: Ham Gallery
zh_cn: 丸灰相册

# SettingsPage_AppInfoCard.Description
source: Version 1.0.0
zh_cn: 版本 1.0.0

# SettingsPage_RepoCard.Header
source: Open-source Repository
zh_cn: 开源仓库

# SettingsPage_RepoCard.Description
source: View source code, submit issues, or contribute on GitHub
zh_cn: 在 GitHub 上查看源代码、提交 Issue 或贡献代码

# SettingsPage_RepoLink.Content
source: View on GitHub
zh_cn: 在 GitHub 上查看

# SettingsPage_LicenseCard.Header
source: Third-party Licenses
zh_cn: 第三方许可证
